package jp.co.enterogawa.nfs.export;

import java.util.Arrays;
import java.util.Base64;

//------------------------------------------------------------------------------
/**
 * NFSファイルハンドルクラスです。<br><br>
 *
 * <p>クラス名称： NFSファイルハンドル</p>
 *
 * @author Shunji Ogawa
 * @version 01.00.00
 */
//------------------------------------------------------------------------------
public class FileHandle {
	//	定数定義	------------------------------------------------------------
	/** NFSv2ファイルハンドル長 */
	public static final int				LENGTH = 32 ;

	//	内部定義	------------------------------------------------------------
	/** ファイルハンドル値 */
	private final byte[]				value ;

	//--------------------------------------------------------------------------
	/**
	 * インスタンスを生成します。<br><br>
	 *
	 * <p>メソッド名称： コンストラクタ</p>
	 *
	 * @param value	ファイルハンドル値
	 */
	//--------------------------------------------------------------------------
	public FileHandle(byte[] value) {
		// 長さが一致しない場合
		if( value.length != LENGTH) {
			throw new IllegalArgumentException( "NFSv2 file handle must be 32 bytes.") ;
		}

		this.value = value.clone() ;
	}

	//--------------------------------------------------------------------------
	/**
	 * ファイルハンドル値を取得します。<br><br>
	 *
	 * <p>メソッド名称： ファイルハンドル値取得</p>
	 *
	 * @return ファイルハンドル値
	 */
	//--------------------------------------------------------------------------
	public byte[] getValue() {
		return value.clone() ;
	}

	//--------------------------------------------------------------------------
	/**
	 * マップキーを取得します。<br><br>
	 *
	 * <p>メソッド名称： マップキー取得</p>
	 *
	 * @return マップキー
	 */
	//--------------------------------------------------------------------------
	public String key() {
		return Base64.getEncoder().encodeToString( value) ;
	}

	//--------------------------------------------------------------------------
	/**
	 * ハッシュコードを取得します。<br><br>
	 *
	 * <p>メソッド名称： ハッシュコード取得</p>
	 *
	 * @return ハッシュコード
	 */
	//--------------------------------------------------------------------------
	@Override
	public int hashCode() {
		return Arrays.hashCode( value) ;
	}

	//--------------------------------------------------------------------------
	/**
	 * 等価判定を行います。<br><br>
	 *
	 * <p>メソッド名称： 等価判定</p>
	 *
	 * @param obj	比較対象
	 * @return true:等価 false:不一致
	 */
	//--------------------------------------------------------------------------
	@Override
	public boolean equals(Object obj) {
		// 同一インスタンスの場合
		if( this == obj) {
			return true ;
		}

		// 型が異なる場合
		if( !(obj instanceof FileHandle other)) {
			return false ;
		}

		return Arrays.equals( value, other.value) ;
	}
}
