package jp.co.enterogawa.nfs.rpc;

//------------------------------------------------------------------------------
/**
 * RPC認証情報クラスです。<br><br>
 *
 * <p>クラス名称： RPC認証情報</p>
 *
 * @author Shunji Ogawa
 * @version 01.00.00
 */
//------------------------------------------------------------------------------
public class RpcCredential {
	//	内部定義	------------------------------------------------------------
	/** 認証方式 */
	private final int					flavor ;

	/** 認証データ */
	private final byte[]				body ;

	//--------------------------------------------------------------------------
	/**
	 * インスタンスを生成します。<br><br>
	 *
	 * <p>メソッド名称： コンストラクタ</p>
	 *
	 * @param flavor	認証方式
	 * @param body		認証データ
	 */
	//--------------------------------------------------------------------------
	public RpcCredential(int flavor, byte[] body) {
		this.flavor = flavor ;
		this.body = body.clone() ;
	}

	//--------------------------------------------------------------------------
	/**
	 * 認証方式を取得します。<br><br>
	 *
	 * <p>メソッド名称： 認証方式取得</p>
	 *
	 * @return 認証方式
	 */
	//--------------------------------------------------------------------------
	public int getFlavor() {
		return flavor ;
	}

	//--------------------------------------------------------------------------
	/**
	 * 認証データを取得します。<br><br>
	 *
	 * <p>メソッド名称： 認証データ取得</p>
	 *
	 * @return 認証データ
	 */
	//--------------------------------------------------------------------------
	public byte[] getBody() {
		return body.clone() ;
	}
}
